JayHeng/imxrt-tool-flash-algo/devices/MIMXRT1024/drivers/fsl_enet.c
#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
/*!
 * brief The IEEE 1588 PTP time stamp interrupt handler.
 *
 * param base  ENET peripheral base address.
 * param handle The ENET state pointer. This is the same state pointer used in the ENET_Init.
 */
void ENET_TimeStampIRQHandler(ENET_Type *base, enet_handle_t *handle)
{
    assert(handle != NULL);

    /* Check if the PTP time stamp interrupt happen. */
    if (0U != ((uint32_t)kENET_TsTimerInterrupt & base->EIR))
    {
        /* Clear the time stamp interrupt. */
        base->EIR = (uint32_t)kENET_TsTimerInterrupt;

        /* Increase timer second counter. */
        handle->msTimerSecond++;

        /* Callback function. */
        if (NULL != handle->callback)
        {
#if FSL_FEATURE_ENET_QUEUE > 1
            handle->callback(base, handle, 0, kENET_TimeStampEvent, NULL, handle->userData);
#else
            handle->callback(base, handle, kENET_TimeStampEvent, NULL, handle->userData);
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
        }
    }

    if (0U != ((uint32_t)kENET_TsAvailInterrupt & base->EIR))
    {
        /* Clear the time stamp interrupt. */
        base->EIR = (uint32_t)kENET_TsAvailInterrupt;
        /* Callback function. */
        if (NULL != handle->callback)
        {
#if FSL_FEATURE_ENET_QUEUE > 1
            handle->callback(base, handle, 0, kENET_TimeStampAvailEvent, NULL, handle->userData);
#else
            handle->callback(base, handle, kENET_TimeStampAvailEvent, NULL, handle->userData);
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
        }
    }
}
#endif /* ENET_ENHANCEDBUFFERDESCRIPTOR_MODE */

/*!
 * brief the common IRQ handler for the tx/rx/error etc irq handler.
 *
 * This is used for the combined tx/rx/error interrupt for single/mutli-ring (frame 0).
 *
 * param base  ENET peripheral base address.
 */
void ENET_CommonFrame0IRQHandler(ENET_Type *base)
{
    uint32_t event    = base->EIR;
    uint32_t instance = ENET_GetInstance(base);

    if (0U != (event & ((uint32_t)kENET_TxBufferInterrupt | (uint32_t)kENET_TxFrameInterrupt)))
    {
        if (s_enetTxIsr[instance] != NULL)
        {
#if FSL_FEATURE_ENET_QUEUE > 1
            s_enetTxIsr[instance](base, s_ENETHandle[instance], 0);
#else
            s_enetTxIsr[instance](base, s_ENETHandle[instance]);
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
        }
    }

    if (0U != (event & ((uint32_t)kENET_RxBufferInterrupt | (uint32_t)kENET_RxFrameInterrupt)))
    {
        if (s_enetRxIsr[instance] != NULL)
        {
#if FSL_FEATURE_ENET_QUEUE > 1
            s_enetRxIsr[instance](base, s_ENETHandle[instance], 0);
#else
            s_enetRxIsr[instance](base, s_ENETHandle[instance]);
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
        }
    }

    if (0U != (event & ENET_TS_INTERRUPT) && (NULL != s_enetTsIsr[instance]))
    {
        s_enetTsIsr[instance](base, s_ENETHandle[instance]);
    }
    if (0U != (event & ENET_ERR_INTERRUPT) && (NULL != s_enetErrIsr[instance]))
    {
        s_enetErrIsr[instance](base, s_ENETHandle[instance]);
    }
}

#if FSL_FEATURE_ENET_QUEUE > 1
/*!
 * brief the common IRQ handler for the tx/rx irq handler.
 *
 * This is used for the combined tx/rx interrupt for multi-ring (frame 1).
 *
 * param base  ENET peripheral base address.
 */
void ENET_CommonFrame1IRQHandler(ENET_Type *base)
{
    uint32_t event    = base->EIR;
    uint32_t instance = ENET_GetInstance(base);

    if (0U != (event & ((uint32_t)kENET_TxBuffer1Interrupt | (uint32_t)kENET_TxFrame1Interrupt)))
    {
        if (s_enetTxIsr[instance] != NULL)
        {
            s_enetTxIsr[instance](base, s_ENETHandle[instance], 1);
        }
    }

    if (0U != (event & ((uint32_t)kENET_RxBuffer1Interrupt | (uint32_t)kENET_RxFrame1Interrupt)))
    {
        if (s_enetRxIsr[instance] != NULL)
        {
            s_enetRxIsr[instance](base, s_ENETHandle[instance], 1);
        }
    }
}

/*!
 * brief the common IRQ handler for the tx/rx irq handler.
 *
 * This is used for the combined tx/rx interrupt for multi-ring (frame 2).
 *
 * param base  ENET peripheral base address.
 */
void ENET_CommonFrame2IRQHandler(ENET_Type *base)
{
    uint32_t event    = base->EIR;
    uint32_t instance = ENET_GetInstance(base);

    if (0U != (event & ((uint32_t)kENET_TxBuffer2Interrupt | (uint32_t)kENET_TxFrame2Interrupt)))
    {
        if (s_enetTxIsr[instance] != NULL)
        {
            s_enetTxIsr[instance](base, s_ENETHandle[instance], 2);
        }
    }

    if (0U != (event & ((uint32_t)kENET_RxBuffer2Interrupt | (uint32_t)kENET_RxFrame2Interrupt)))
    {
        if (s_enetRxIsr[instance] != NULL)
        {
            s_enetRxIsr[instance](base, s_ENETHandle[instance], 2);
        }
    }
}

void ENET_Ptp1588IRQHandler(ENET_Type *base)
{
    uint32_t instance = ENET_GetInstance(base);
    s_enet1588TimerIsr[instance](base, s_ENETHandle[instance]);
}
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */

#if defined(ENET)
#if FSL_FEATURE_ENET_QUEUE < 2
void ENET_Transmit_IRQHandler(void)
{
    if (s_enetTxIsr[0] != NULL)
    {
        s_enetTxIsr[0](ENET, s_ENETHandle[0]);
    }
    SDK_ISR_EXIT_BARRIER;
}

void ENET_Receive_IRQHandler(void)
{
    if (s_enetRxIsr[0] != NULL)
    {
        s_enetRxIsr[0](ENET, s_ENETHandle[0]);
    }
    SDK_ISR_EXIT_BARRIER;
}

void ENET_Error_IRQHandler(void)
{
    if (s_enetErrIsr[0] != NULL)
    {
        s_enetErrIsr[0](ENET, s_ENETHandle[0]);
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif /* FSL_FEATURE_ENET_QUEUE < 2 */

void ENET_1588_Timer_IRQHandler(void)
{
    if (s_enetTsIsr[0] != NULL)
    {
        s_enetTsIsr[0](ENET, s_ENETHandle[0]);
    }
    SDK_ISR_EXIT_BARRIER;
}

void ENET_DriverIRQHandler(void)
{
    ENET_CommonFrame0IRQHandler(ENET);
    SDK_ISR_EXIT_BARRIER;
}

#if FSL_FEATURE_ENET_QUEUE > 1
void ENET_1588_Timer_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(ENET);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
#endif /* ENET */

#if defined(ENET1)
void ENET1_DriverIRQHandler(void)
{
    ENET_CommonFrame0IRQHandler(ENET1);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* ENET1 */

